In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [2]:
data = {
    "name": ["a", "b", "c", "d", "a", "c"],
    "eng": [8, 7, 5, 8, 8, 5],
    "hindi": [2, 3, 4, 5, 2, 7]
}

In [3]:
df=pd.DataFrame(data)
df 
## in this 0 and 4 row has same data(i.e duplicate data)

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      7

In [4]:
## To check duplicates
# df["duplicated"]=df.duplicated() 
# df

In [5]:
df.drop_duplicates(inplace=True)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      7

### Handling large dataset

In [6]:
dataset=pd.read_csv("loan_data_set.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [7]:
dataset.duplicated().sum()

np.int64(0)

Another method to determine that duplicates are presnt or not

In [8]:
dataset.shape

(614, 13)

In [9]:
dataset.drop_duplicates(inplace=True)

In [10]:
dataset.shape

(614, 13)